                            # РАБОТА СО СПИСКОМ
print('СПИСКИ')
print('======')
# 1) Список фруктов.
my_list = ["яблоко", "банан", "апельсин", "мандарин", "персик", "абрикос", "виноград"]
# 2) Выводим список на экран.
print(my_list)
# 3) Выводим первый и последний элемент из списка на экран.
# Способ первый.
print('_______________________________________________________________________')
print(my_list[0], my_list[6])
print('_______________________________________________________________________')
# Способ второй
print(my_list[0])
print(my_list[6])
print('_______________________________________________________________________')
# Третий способ
print(my_list[0:8:6])
print('_______________________________________________________________________')
# 4) Выводим на экран подсписок с третьего по пятый элемент.
# Способ первый.
print(my_list[2], my_list[3], my_list[4])
print('_______________________________________________________________________')
# Второй способ
print(my_list[2])
print(my_list[3])
print(my_list[4])
print('_______________________________________________________________________')
# Третий способ
print(my_list[2:5])
print('_______________________________________________________________________')
# 5) Изменяем значение третьего элемента
my_list[2] = "арбуз"
# Выводим на экран измененный список
print(my_list)
print('_______________________________________________________________________')
                         # РАБОТА СО СЛОВАРЕМ
print('СЛОВАРИ')
print('=======')
# 1) Создем словарь слов с переводом
my_dict = {'aplle': 'яблоко', 'banana': 'банан', 'peach': 'персик', 'tangerine': 'мандарин', 'apricot': 'абрикос'}
# 2) Выводим словарь на экран
print(my_dict)
print('_______________________________________________________________________')
# 3) Выводим на экран значение для ключа 'peach'
print(my_dict['peach'])
print('_______________________________________________________________________')
# 4) Добавление новых ключей со значениями
my_dict['orange'] = 'апельсин'
my_dict['grape'] = 'виноград'
# Выводим измененный словарь на экран
print(my_dict)
print('_______________________________________________________________________')